<template><h1 id="术语"><a class="header-anchor" href="#术语">#</a> 术语</h1>
<blockquote>
<p>本节列出了文档中常见的术语，方便您查阅。</p>
</blockquote>
<h4 id="站点-site"><a class="header-anchor" href="#站点-site">#</a> 站点(Site)</h4>
<p>即网站，XYCMS是站群系统(站点集合），会为每个站点分配独立的文件目录、栏目架构以及内容数据。</p>
<p>主站点指站点目录在根目录的站点，只能创建一个；子站点指拥有单独文件夹作为站点目录的站点，可以创建任意多个，同时子站点还可以创建下级站点，下级站点的站点文件夹存储于上级站点文件夹内。站群架构为树形结构。</p>
<h3 id="栏目-channel"><a class="header-anchor" href="#栏目-channel">#</a> 栏目(Channel)</h3>
<p>栏目也叫频道或者菜单，用于将站点的内容进行归类存放。栏目与文件夹类似，可以不断创建下级栏目，形成一个树状结构。</p>
<p>站点首页也是栏目，只不过此栏目没有父节点，是站点内所有栏目的根节点。</p>
<h3 id="内容-content"><a class="header-anchor" href="#内容-content">#</a> 内容(Content)</h3>
<p>内容代表 XYCM 需要进行增删改查的数据，可以是文章、新闻、博客、视频，甚至站点的友情链接、广告等一切可结构化的数据均可以成为内容。</p>
<p>一篇内容只能属于具体的一个栏目，STL标签通常通过栏目来定位进而获取内容。</p>
<h3 id="模板-template"><a class="header-anchor" href="#模板-template">#</a> 模板(Template)</h3>
<p>模板是一个包含了显示样式的HTML文件，通常在模板文件中会包含HTML标签、CSS标签、JS标签以及STL标签，系统在生成静态页面时需要获取模板文件的内容，解析并替换模板文件中的STL标签。</p>
<p>根据系统生成页面的类型，模板分为首页模板、栏目模板、内容模板以及单页模板。</p>
<h3 id="静态页面-static"><a class="header-anchor" href="#静态页面-static">#</a> 静态页面(Static)</h3>
<p>静态页面也称为HTML页面，是相对动态页面而言的。静态网页不是指网页中的元素都是静止不动的，而是指网页文件中没有程序代码，只有HTML（超文本标记语言）标记，一般后缀为.htm、.html、.shtml或.json、.xml等。</p>
<p>静态页面一经生成，内容就不会再变化，不管何人何时访问，显示的内容都是一样的。</p>
<p>如果要修改静态页面的内容，就必须通过 XYCMS 重新生成此页面。</p>
<h3 id="动态页面-dynamic"><a class="header-anchor" href="#动态页面-dynamic">#</a> 动态页面(Dynamic)</h3>
<p>动态网页是指在网页文件中除了HTML标记以外，还包括一些实现特定功能的程序代码，这些程序代码使得浏览器与服务器之间可以进行交互，即服务器端可以根据客户端的不同请求动态产生网页内容。</p>
<p>动态网页的后缀名通常根据所用的程序设计语言的不同而不同，一般为.asp、.aspx、cgi、.php、.perl、.jsp等。</p>
<p>动态页面每次访问都需要连接数据库获取内容，同时容易被黑客攻击，所以 XYCMS 不支持直接呈现动态页面，如果希望实现动态页面的功能，可以通过 <code>&lt;stl:dynamic&gt;</code> 动态标签实现动态数据载入。</p>
</template>